{
  "landing": {
    "subtitle": "Global Pcb Specialists",
    "landingCards": [
      {
        "title": "PCB Design",
        "srcDesktop": "images/pcbDesignBgWhite.svg",
        "srcMobile": "https://ecitech.com/wp-content/uploads/2020/04/pcb_main.jpg",
        "alt": "pcb Design as a service",
        "id": "design",
        "description": "We can offer rapid 24-hour lead times on small batch productions, or for very large scale productions, we have international manufacturing partners"
      },
      {
        "title": "PCB Fabrication",
        "srcDesktop": "images/pcbFabricationBgWhite.svg",
        "srcMobile": "https://ecitech.com/wp-content/uploads/2020/04/pcb_main.jpg",
        "alt": "pcb fabrication as a service",
        "id": "fabrication",
        "description": "Creekview EMS is one of the few UK printed circuit board manufacturers to provide a complete electronic manufacturing service."
      },
      {
        "title": "PCB Assembly",
        "srcMobile": "https://elitees.com/wp-content/uploads/2021/06/DSCF9318.jpg",
        "srcDesktop": "/images/pcbAssemblyBg.svg",
        "alt": "pcb Assembly as a service",
        "id": "assembly",
        "description": "At Creekview EMS, we provide our customers with reliable printed circuit board assembly solutions that achieve quality results at competitive prices. We specialise in surface mount and through-hole PCB assembly, configured to meet the design, specification and volume of your project. With a multi-assembly setup, we can manufacture different products simultaneously and our conventional PCB assembly capabilities enable us to manufacture single or double-sided, mixed technology PCBs."
      },
      {
        "title": "Box Builds",
        "srcDesktop": "images/box-build-logo.svg",
        "srcMobile": "https://www.miracle.net.in/wp-content/uploads/2019/05/Outsourcing-A-Box-Build-Assembly-All-You-Need-To-Know.jpg",
        "alt": "Box Builds as a service",
        "id": "box-build",
        "description": "Box build assembly uses all the skills & manufacturing expertise of Creekview, with the addition of completing your product to a finished item, ready to go"
      }
    ]
  },
  "about": [
    "Originally established as ##Valco UK Ltd## in 1998, the company split its mechanical and electrical divisions with the latter emerging as __Creek View Electronics__ in 2005. This meant that we could continue to grow within the --electrical manufacturing-- industry and provide a better service to our customers. As one of the leading ##electronic design engineers in Essex##, we specialise in a variety of services.",
    "From conformal coating and cable assembly to box build assembly and __electrical testing__ and __inspection services__, you can ensure that Creek View Electronics will provide a service that is second to none. So, if you're looking for a high quality and reliable electronic design company, why not choose Creek View Electronics? For many years, Creek View Electronics obtained its printed circuit boards from Photomechanical Services Ltd, which was established in 1969.",
    "Recognising the opportunity to provide customers with an --end-to-end service solution--, enhanced product quality and faster lead times, both companies joined forces and now trade under Creek View Electronics Ltd."
  ],
  "services": {
    "design": {
      "title": "PCB Design",
      "id": "design",
      "cardHeaders": ["Creative Design Strategies", "Comprehensive Solutions", "3D Engineering"],
      "main": [
        {
          "type": "text",
          "content": [
            "With extensive experience in a wide variety of industries and systems, Creekview EMS can provide you with a complete electronics solution. From refining a concept to production of the final product, we work together with our customers at every step, to achieve successful results.",
            "Our aim is to deliver your project on time and to within your budget, and to ultimately surpass your expectations. Feasibility studies may first be undertaken to ensure that your project is viable both in engineering and economic terms. We then utilise creative design strategies to reduce costs wherever possible, and employ technical experts to support, refine and direct your project to completion.",
            "We offer a comprehensive range of design solutions including rapid prototyping for full 3D visual and engineering validation. We can also convert 2D drawings or reverse engineer parts into fully interactive 3D CAD models. These systems enable us to apply design for manufacture techniques throughout the project, ensuring that the product is optimised for the correct manufacturing and assembly process. This facilitates expert analysis of a product during the design process, where we can check parts and assemblies, and detect interference long before prototyping and manufacturing. This saves our customers time and money."
          ]
        }
      ],
      "aside": [
        { "type": "title", "content": "Technical Specifications" },
        {
          "type": "text",
          "content": "We typically start from your general description or initial concept, undertake a feasibility study, produce a functional specification, circuit design and hardware development, software and firmware development, PCB layout and housing thought to pre-production or prototype build and finally production. Our extensive experience covers all types of embedded systems using microcontroller designs, including, ECG monitoring, RFID applications, CNC control, balanced battery chargers, monitoring and control systems and medical devices."
        },
        { "type": "title", "content": "Incorporated Systems" },
        {
          "type": "list",
          "content": [
            "PIC & Microcontrollers",
            "Microprocessors",
            "Digital embedded controls",
            "Ethernet & USB",
            "Wireless & Bluetooth",
            "Battery & mains capability",
            "Serial communications",
            "Signal processing with 8 bit, 16 bit or 32 bit"
          ]
        },

        { "type": "title", "content": "Design Services" },
        {
          "type": "list",
          "content": [
            "Circuit design - analogue & digital",
            "PCB & Enclosure design",
            "3D concept design",
            "Interactive 3D CAD models",
            "2D drawings",
            "Reverse engineering",
            "Simulation"
          ]
        }
      ]
    },
    "assembly": {
      "title": "PCB Assembly",
      "id": "assembly",
      "cardHeaders": ["Creative Design Strategies", "Comprehensive Solutions", "3D Engineering"],
      "main": [
        {
          "type": "text",
          "content": [
            "At Creekview EMS, we provide our customers with reliable printed circuit board assembly solutions that achieve quality results at competitive prices. We specialise in surface mount and through-hole PCB assembly, configured to meet the design, specification and volume of your project.",
            "With a multi-assembly setup, we can manufacture different products simultaneously and our conventional PCB assembly capabilities enable us to manufacture single or double-sided, mixed technology PCBs. We have recently invested heavily into our surface mount technology, which now includes a Europlacer speed print automated stencil printer and Europlacer iineo II SMT machine.",
            "One of our three SMD placement machines is installed as high capacity automatic SMD placement, with several quick slot-in carts that allow us to switch setup quickly. This facilitates our extensive production capacity and ensures that we can consistently deliver high standards to our customers. Our through-hole facility is well-equipped, with skilled IPC trained operators to populate and solder components to boards. We can also provide automated placement of micro-BGA parts, giving us the flexibility to accommodate your requirements for each project."
          ]
        }
      ],
      "aside": [
        { "type": "title", "content": "Consistent Quality" },
        {
          "type": "text",
          "content": "Our components are sourced from around the world to ensure that we can provide high quality, cost-effective solutions to our customers. Traceability is a crucial element of this and a key requirement in our procurement process. We look meticulously at each component to determine the part that is used and then establish the manufacturer."
        },
        {
          "type": "text",
          "content": "Each PCB is inspected using our state of the art automated optical inspection system to ensure that they are defect free before being released for the next stage of the product build. Fault finding can then be carried out to component level. We have experience in testing for many disciplines including analogue and digital systems."
        },
        {
          "type": "text",
          "content": "We provide small to high volume PCB assembly production batches, with high quality rapid manufacturing to give our customers short lead times and timely deliveries. Our flexible assembly capabilities also enable us manufacture prototypes at speed."
        },
        {
          "type": "text",
          "content": "As we manufacture our own PCBs, we can ensure that each individual PCB is tooled with the optimum step and repeat, breakout tabs and fiducials to suit our assembly. This allows us to achieve the lowest possible production costs. Learn more about our PCB fabrication here."
        },
        { "type": "title", "content": "End-To-End Reliability" },
        {
          "type": "list",
          "content": [
            "Europlacer iineo pick and place machine",
            "Europlacer EP710 paste machine",
            "Multitroniks DHM-120",
            "Multitroniks SHM-120",
            "BTU-VIP-70 Lead-free PCB oven",
            "Extra Eye first article inspection system"
          ]
        },

        { "type": "title", "content": "Conventional Assembly" },
        {
          "type": "list",
          "content": [
            "Hand assembly & soldering on single/double sided conventional PCBs & SMT PCBs",
            "Lead-free assembly as standard",
            "JVC Digital Camera",
            "IPC-A610-C acceptability standard"
          ]
        },

        { "type": "title", "content": "Cable Assembly" },
        {
          "type": "list",
          "content": [
            "Wire loom assembly onto fabricated metal panels",
            "Bespoke cable assemblies",
            "KOMAX 210 cut and strip",
            "GLW EC65 electric crimp tools",
            "IPC-A610-C acceptability standard",
            "Single wire preparation"
          ]
        },

        { "type": "title", "content": "Mechanical Assembly" },
        {
          "type": "list",
          "content": [
            "Cabinet build",
            "Nearby engineering facility",
            "Nearby metal fabrication supplier",
            "Assembly of boxed products",
            "ICP-A610-C acceptability standard"
          ]
        },

        { "type": "title", "content": "Testing" },
        {
          "type": "list",
          "content": [
            "Testing of conventional and SMT PCBs to test procedures",
            "Using DVM scopes and PIC programs",
            "Fault finding to component level"
          ]
        }
      ]
    },
    "fabrication": {
      "title": "PCB Fabrication",
      "id": "fabrication",
      "cardHeaders": ["Creative Design Strategies", "Comprehensive Solutions", "3D Engineering"],
      "main": [
        {
          "type": "text",
          "content": [
            "Our customers can take advantage of our comprehensive range of design services for different types of printed circuit board, including: single sided PCBs, double sided conventional PCBs, plated through-hole PCBs, multilayer PCBs.",
            "With over 48-years experience in PCB fabrication, we have used our expertise to continually refine our processes. And meticulous management of our entire manufacturing system ensures that only one tooling charge will be applied. This guarantees our customers high quality products at competitive prices. We can offer rapid 24-hour lead times on small batch productions, or for very large scale productions, we have international manufacturing partners that can be utilised.",
            "The speed at which we deliver your products is always based upon your requirements and you are guaranteed to receive the same high quality standards on every product. Quality testing is carried out at our UK headquarters, with strict standards which must be met. Creek View Electronics has visited its international suppliers to ensure that processes are worked within globally recognised work ethics, without compromising on quality."
          ]
        }
      ],
      "aside": [
        {
          "type": "list",
          "content": [
            "Maximum active PCB size: 900 mm x 900 mm",
            "Materials: High Tg Fr4, Standard Tg Fr4 & Rogers, Polyimide, PTFE",
            "Solder resists: Liquid photo-imageable, colours: green, red, blue, black, white, silver grey",
            "Legend inks: all colours including white standard and yellow",
            "Multi-layer: layer counts from 1 to 12 layers",
            "PCB thicknesses from 0.2mm to 3.2 mm",
            "Copper weights: 1/2 oz to 3 oz, 17.5µm to 105µm",
            "PCB finishes: - Hot air solder level both lead-free and leaded: immersion silver or immersion gold over electroless nickel",
            "Min track and gap: 0.1 mm on 1/2 oz copper start, 0.15 mm on 1 oz copper start, 0.2 mm on 2 oz copper start",
            "Smallest drill at size: 0.2mm Smallest recommended drill size: 0.3mm",
            "Minimum solder resist to copper clearance: 0.1 mm",
            "Maximum plated hole depth to diameter aspect ratio on a 1.6 mm thick PCB is 6:1",
            "Mechanical: edge chamfering, counter-sinking, counter-boring, routing, scoring all available"
          ]
        },
        {
          "type": "title",
          "content": "Electrical Test Specifications"
        },
        {
          "type": "list",
          "content": [
            "Test area: 610 x 500 mm",
            "Number of probes: 2 front, 2 rear",
            "Minimum board size: 76 x 76 mm",
            "Maximum board thickness for clamping: 6 mm",
            "Repeatable accuracy: +/- 10 µm",
            "Resolution: 6µm",
            "Minimum pad pitch: 180µm",
            "Test voltage of resistance measurement continuity test: 0-10V",
            "Isolation test: 250V",
            "Test current of resistance measurement continuity test: 2.65µA-150mA"
          ]
        }
      ]
    },
    "box-build": {
      "title": "Box Builds",
      "id": "box-build",
      "cardHeaders": ["Creative Design Strategies", "Comprehensive Solutions", "3D Engineering"],
      "main": [
        {
          "type": "text",
          "content": [
            "Box build assembly uses all the skills & manufacturing expertise of Creekview, with the addition of completing your product to a finished item, ready to go on your shelf or straight to your end customer, we cover it Having the \"full package\" will give you the peace of mind it's all in one place, with one point contact.",
            "If we have made it , we will guarantee our workmanship. Please contact us with your full spec to take full advantage of our turnkey facility."
          ]
        }
      ],
      "aside": [{ "type": "gallery", "content": ["img"] }]
    }
  },
  "gallery": {
    "box-build": [
      {
        "name": "IMG_2698 Y.jpg",
        "alt": "Custom PCBS",
        "description": "Box-build Description Pending"
      },

      {
        "name": "IMG_2712.jpg",
        "alt": "Custom PCBS",
        "description": "Box-build Description Pending"
      },
      {
        "name": "IMG_2732 Y.jpg",
        "alt": "Custom PCBS",
        "description": "Box-build Description Pending"
      }
    ],
    "design": [
      {
        "name": "IMG_2739.jpg",
        "alt": "Custom PCBS",
        "description": "design Description Pending"
      },
      {
        "name": "IMG_2742.jpg",
        "alt": "Custom PCBS",
        "description": "design Description Pending"
      },
      {
        "name": "IMG_2766.jpg",
        "alt": "Custom PCBS",
        "description": "design Description Pending"
      }
    ],
    "assembly": [
      {
        "name": "IMG_2768.jpg",
        "alt": "Custom PCBS",
        "description": "assembly Description Pending"
      },
      {
        "name": "IMG_2779.jpg",
        "alt": "Custom PCBS",
        "description": "assembly Description Pending"
      }
    ],
    "fabrication": [
      {
        "name": "IMG_2768.jpg",
        "alt": "Custom PCBS",
        "description": "fabrication Description Pending"
      },
      {
        "name": "IMG_2779.jpg",
        "alt": "Custom PCBS",
        "description": "fabrication Description Pending"
      }
    ]
  }
}
